In [224]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import sys
from google.colab import files
import requests
import csv
from io import StringIO

In [203]:
#didn't seem possible to load csv from github
df1 = pd.read_csv('Countries.csv')
df1

       Name     People     Area   BIP Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

In [115]:
#last 4 rows
df1.tail(4)

       Name     People     Area   BIP Currency
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

In [118]:
#where currency is eur

df1[df1['Currency'] == "EUR"]

      Name    People    Area   BIP Currency
0  Germany  82521653  357385  3466      EUR
3    Italy  60501718  301338  1850      EUR

In [128]:
#display name and currency
df2 = df1.loc[:,  ['Name','Currency']]
df2

       Name Currency
0   Germany      EUR
1     Japan      YEN
2    Canada      CAD
3     Italy      EUR
4  Brazilia     REAL

In [137]:
#where bip is over 2000

df1[df1['BIP']> 2000]

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN

In [143]:
#where inhabitants are between 50 and 150 million people

df2  = df1[(df1['People'] >= 50000000) & (df1['People'] <= 150000000)]
df2

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN
3    Italy   60501718  301338  1850      EUR

In [144]:
#change BIP to bip
df2 = df1.rename({'BIP': 'Bip'}, axis=1)  # new method
df2

       Name     People     Area   bip Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

In [148]:
#sum of bip
bip = df1['BIP'].sum()
print (bip)

13581

In [150]:
#average people of all countries
average = df1['People'].mean()
print (average)

102786293.6

In [154]:
#sort by name
df2 = df1.sort_values(by ='Name' )
df2

       Name     People     Area   BIP Currency
4  Brazilia  208360000  8515770  1798     REAL
2    Canada   36503097  9984670  1529      CAD
0   Germany   82521653   357385  3466      EUR
3     Italy   60501718   301338  1850      EUR
1     Japan  126045000   377835  4938      YEN

In [244]:
df2 = df1.copy()
print(df2["Area"].dtypes == 'int64')

if df2["Area"].dtypes == 'int64': 
     df2.loc[df1["Area"] > 1000000, "Area"] = "Big"
if df2["Area"].dtypes == 'int64': 
    df2.loc[df1["Area"] < 1000000, "Area"] = "Small"

df2

True

       Name     People    Area   BIP Currency
0   Germany   82521653  357385  3466      EUR
1     Japan  126045000  377835  4938      YEN
2    Canada   36503097     Big  1529      CAD
3     Italy   60501718  301338  1850      EUR
4  Brazilia  208360000     Big  1798     REAL